name: "preprocess"
backend: "python"

input [
  {
    name: "preprocess_input"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1, 3 ]
  }
]

output [
  {
    name: "preprocess_output1"
    data_type: TYPE_FP32
    dims: [ -1, 3, -1, -1 ]
  },
  {
    name: "preprocess_output2"
    data_type: TYPE_FP32
    dims: [ -1, 2 ]
  },
  {
    name: "preprocess_output3"
    data_type: TYPE_FP32
    dims: [ -1, 2 ]
  }
]

instance_group [
  {
      count: 1
      kind: KIND_CPU
  }
]